In [1]:
import pandas as pd

# reading and writing Excel File

In [12]:
df1 = pd.read_excel('file_example.xls')

In [7]:
df2 = pd.read_excel('file_example.xls', sheet_name='Data')
df2

       Name  Gender        Country  Age    Id
0     Dulce  Female  United States   32  1562
1      Mara  Female  Great Britain   25  1582
2    Philip    Male         France   36  2587
3  Kathleen  Female  United States   25  3549
4   Nereida  Female  United States   58  2468
5    Gaston    Male  United States   24  2554
6      Etta  Female  Great Britain   56  3598
7   Earlean  Female  United States   27  2456
8  Vincenza  Female  United States   40  6548

In [8]:
df2.head()

       Name  Gender        Country  Age    Id
0     Dulce  Female  United States   32  1562
1      Mara  Female  Great Britain   25  1582
2    Philip    Male         France   36  2587
3  Kathleen  Female  United States   25  3549
4   Nereida  Female  United States   58  2468

In [11]:
df2.head(10)

       Name  Gender        Country  Age    Id
0     Dulce  Female  United States   32  1562
1      Mara  Female  Great Britain   25  1582
2    Philip    Male         France   36  2587
3  Kathleen  Female  United States   25  3549
4   Nereida  Female  United States   58  2468
5    Gaston    Male  United States   24  2554
6      Etta  Female  Great Britain   56  3598
7   Earlean  Female  United States   27  2456
8  Vincenza  Female  United States   40  6548

In [20]:
def convert_gender(cell):
    if cell == 'Female': 
        return 'Women'
    elif cell == 'Male':
        return 'Men'

def convert_country(cell):
    if cell == 'United States':
        return 'USA'

df3 = pd.read_excel('file_example.xls', sheet_name='Data', converters={'Gender': convert_gender, 'Country': convert_country})
df3

       Name Gender Country  Age    Id
0     Dulce  Women     USA   32  1562
1      Mara  Women    None   25  1582
2    Philip    Men    None   36  2587
3  Kathleen  Women     USA   25  3549
4   Nereida  Women     USA   58  2468
5    Gaston    Men     USA   24  2554
6      Etta  Women    None   56  3598
7   Earlean  Women     USA   27  2456
8  Vincenza  Women     USA   40  6548

In [28]:
df4 = pd.read_excel('file_example.xls', header=7)
df4

   7      Etta     Hurn  Female  Great Britain  56  15/10/2017  3598
0  8   Earlean   Melgar  Female  United States  27  16/08/2016  2456
1  9  Vincenza  Weiland  Female  United States  40  21/05/2015  6548

In [31]:
df1.tail(1)

   0 First Name Last Name  Gender        Country  Age        Date    Id
8  9   Vincenza   Weiland  Female  United States   40  21/05/2015  6548